In [1]:
import pandas as pd
import numpy as np

In [7]:
dict = { 
        "name" : ["arshita", "aryan", "ishika" , "sarthak"],
        "roll no" : [17 , 18 , 19 , 20]
}

In [9]:
df = pd.DataFrame(dict)

In [11]:
df

      name  roll no
0  arshita       17
1    aryan       18
2   ishika       19
3  sarthak       20

DataFrame helps to covert our dictionary into a excel type sheet and we can convert this into csv , json any format like we want

In [15]:
df.to_csv('friends.csv')

In [17]:
df.head()

      name  roll no
0  arshita       17
1    aryan       18
2   ishika       19
3  sarthak       20

In [19]:
df.tail()

      name  roll no
0  arshita       17
1    aryan       18
2   ishika       19
3  sarthak       20

In [21]:
df.describe()

         roll no
count   4.000000
mean   18.500000
std     1.290994
min    17.000000
25%    17.750000
50%    18.500000
75%    19.250000
max    20.000000

Describe column calculates everything for all numerical columns in our dataset

In [45]:
friends = pd.read_csv('friends.csv' , index_col=0)

In [47]:
friends['roll no']

0    17
1    18
2    19
3    20
Name: roll no, dtype: int64

In [49]:
friends['roll no'][0]

17

In [51]:
friends['roll no'][0] = 50

/var/folders/wt/kc0ps13179n9jdr9lwb24vq00000gn/T/ipykernel_9074/2045514776.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friends['roll no'][0] = 50

In [53]:
friends.head()

      name  roll no
0  arshita       50
1    aryan       18
2   ishika       19
3  sarthak       20

Pandas is mainly like a excel sheet but it is written in python and you can use python libraries in it 
Pandas use numpy for power and speed
random.rand is the function in numpy to generate 2-d array within range of 0-1

In [55]:
newdf= pd.DataFrame(np.random.rand(334,5) , index=np.arange(334))

In [57]:
newdf.head()

          0         1         2         3         4
0  0.586290  0.214733  0.892123  0.764117  0.067529
1  0.222782  0.119633  0.103637  0.259773  0.010141
2  0.250837  0.804726  0.294311  0.449729  0.434748
3  0.767132  0.991832  0.007424  0.618058  0.896714
4  0.363599  0.271196  0.428266  0.271703  0.467525

In [59]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.480641    0.470964    0.498104    0.498017    0.521238
std      0.281973    0.287426    0.279843    0.288797    0.289983
min      0.015445    0.000051    0.005039    0.009093    0.006624
25%      0.230867    0.231081    0.259782    0.247100    0.285161
50%      0.486059    0.447868    0.503586    0.491484    0.527990
75%      0.726023    0.725100    0.744693    0.764580    0.771041
max      0.999579    0.991832    0.999890    0.994779    0.997574

In [61]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [63]:
newdf.to_numpy()

array([[0.58628975, 0.21473298, 0.89212321, 0.76411653, 0.0675291 ],
       [0.22278237, 0.11963343, 0.10363709, 0.25977315, 0.01014117],
       [0.25083721, 0.80472552, 0.29431086, 0.44972921, 0.43474818],
       ...,
       [0.19818347, 0.74368198, 0.87950347, 0.25198054, 0.81205012],
       [0.04418108, 0.53931121, 0.64963913, 0.70017639, 0.30073667],
       [0.09597879, 0.21837878, 0.72841965, 0.73199076, 0.65141104]])

In [65]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.586290,0.222782,0.250837,0.767132,0.363599,0.971518,0.179713,0.270271,0.483945,0.325266,...,0.572784,0.529409,0.327675,0.305302,0.571633,0.793738,0.634083,0.198183,0.044181,0.095979
1,0.214733,0.119633,0.804726,0.991832,0.271196,0.074386,0.125858,0.015755,0.278848,0.890556,...,0.075912,0.518097,0.505163,0.143558,0.152127,0.031271,0.808326,0.743682,0.539311,0.218379
2,0.892123,0.103637,0.294311,0.007424,0.428266,0.337909,0.478955,0.699104,0.999890,0.050423,...,0.592095,0.071542,0.749287,0.158538,0.444647,0.718677,0.498615,0.879503,0.649639,0.728420
3,0.764117,0.259773,0.449729,0.618058,0.271703,0.825787,0.489637,0.204112,0.740117,0.292210,...,0.055769,0.229853,0.819501,0.724899,0.931525,0.129030,0.246934,0.251981,0.700176,0.731991
4,0.067529,0.010141,0.434748,0.896714,0.467525,0.827994,0.405004,0.018677,0.418710,0.517568,...,0.039027,0.771563,0.030859,0.733665,0.374379,0.899738,0.866887,0.812050,0.300737,0.651411

newdf2 act as pointer to newdf if u change newdf2 it will affect newdf

In [67]:
newdf2 = newdf

copy() is just a function if we change newdf3 it will not affect newdf

In [69]:
newdf3 = newdf.copy()

In [79]:
newdf= newdf.drop(0,axis=0)

In [83]:
newdf.loc[1,1]

0.1196334251724891

In [85]:
newdf.loc[[1,2] , [3,4]]

          3         4
1  0.259773  0.010141
2  0.449729  0.434748